# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
spi = input['mumu', 12, 1, [1, 2, 13], None, complex(7, 3), 1.3, True, bytearray(b'text')]

for el in spi:
    print("элемент ", el, " имеет тип ", type(el))
