# 6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие
# лекционных, практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета
# не обязательно были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий
# по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

f_obj = open("text_6.txt")
ch = '0123456789'
d = {}
for line in f_obj:
    s = line.replace('(', ' ')
    s = s.split()
    sum_ch = [int(el) for el in s if el[0] in ch]
    d[s[0]] = sum(sum_ch)
print(d)
f_obj.close()

